import pytest


@pytest.fixture
def test_transactions():
    return [
        {
            "Дата операции": "01.06.2023 12:00:00",
            "Сумма платежа": "-100.50",
            "Категория": "Покупки",
            "Описание": "Магазин"
        },
        {
            "Дата операции": "15.06.2023 18:30:00",
            "Сумма платежа": "-250.00",
            "Категория": "Ресторан",
            "Описание": "Ужин"
        },
        {
            "Дата операции": "20.06.2023 10:00:00",
            "Сумма платежа": "-75.00",
            "Категория": "Транспорт",
            "Описание": "Такси"
        },
        {
            "Дата операции": "05.05.2023 08:15:00",
            "Сумма платежа": "-500.00",
            "Категория": "Медицина",
            "Описание": "Аптека"
        },
        {
            "Дата операции": "25.05.2023 14:45:00",
            "Сумма платежа": "-120.00",
            "Категория": "Покупки",
            "Описание": "Одежда"
        }
    ]
